In [1]:
import pandas as pd
import numpy as np

El dataset train.csv contiene datos del accidente que sufrió el Titanic en la noche del 14 de abril de 1912. 

Las variables que contiene son las siguientes:

Passengerid: Nº identificador de cada pasajero.

Survived: 1 o 0 para indicar si sobrevivió o no.

Pclass: A qué categoría pertenecía el pasajero 1ª a 3ª

Name

Sex

Age

Fare: Precio del billete en dólares.

Cabin: Cabina en la que se alojaba el pasajero.

Embarked: En qué puerto embarcó.

Utiliza estos datos para contestar a las siguientes preguntas:

### Ejercicio 1

- Carga el set de datos en una variable llamada 'titanic'

In [2]:
titanic = pd.read_csv('train.csv')
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

- Obtén el numero de filas y columnas incluidas en el set de datos.

In [3]:
titanic.shape

(891, 12)

- Obtén las primeras 10 observaciones para ver qué pinta tienen.

In [4]:
titanic.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

- Obtén el listado de variables incluidas en el set de datos y sus tipos.

In [5]:
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

- Obtén la distribución de las variables categóricas (sex, embarked, survived, pclass) del set de datos. Es decir, valores únicos / valores totales.

In [6]:
titanic['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [7]:
titanic['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [8]:
titanic['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [9]:
titanic['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

Obtén los estadísticos básicos de las variables del set de datos.

In [10]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### Ejercicios 2

- Indica en qué variables hay valores con NA, NULL o vacíos "" y cuál es su proporción dentro de la variable.

In [11]:
# Miro donde hay nan
var_nan = titanic.isna().sum()
var_nan

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [12]:
# Calculo la proporción en las variables donde hay Nan.
prop_age = titanic['Age'].isna().sum()/len(titanic['Age'])
prop_age

0.19865319865319866

In [13]:
prop_cabin = titanic['Cabin'].isna().sum()/len(titanic['Cabin'])
prop_cabin

0.7710437710437711

In [14]:
prop_embarked = titanic['Embarked'].isna().sum()/len(titanic['Embarked'])
prop_embarked

0.002244668911335578

- Imputa la media del valor de la variable en el caso de las numéricas y "No disponible" en el caso de string.

In [15]:
# Imputar la media en la variables numericas

numeric_variables = titanic.select_dtypes(include = np.number).columns
titanic[numeric_variables] = titanic[numeric_variables].fillna(titanic[numeric_variables].mean())

In [16]:
titanic[numeric_variables]

     PassengerId  Survived  Pclass        Age  SibSp  Parch     Fare
0              1         0       3  22.000000      1      0   7.2500
1              2         1       1  38.000000      1      0  71.2833
2              3         1       3  26.000000      0      0   7.9250
3              4         1       1  35.000000      1      0  53.1000
4              5         0       3  35.000000      0      0   8.0500
..           ...       ...     ...        ...    ...    ...      ...
886          887         0       2  27.000000      0      0  13.0000
887          888         1       1  19.000000      0      0  30.0000
888          889         0       3  29.699118      1      2  23.4500
889          890         1       1  26.000000      0      0  30.0000
890          891         0       3  32.000000      0      0   7.7500

[891 rows x 7 columns]

In [17]:
# Imputar 'No disponible' en las varibales de tipo string.

string_variables = titanic.select_dtypes(include = np.object).columns
titanic[string_variables] = titanic[string_variables].fillna('No disponible')

/var/folders/xd/150vcs3n0m70kj6mtzp7m12w0000gn/T/ipykernel_33298/2602735440.py:3: DeprecationWarning: `np.object` is a deprecated alias for the builtin `object`. To silence this warning, use `object` by itself. Doing this will not modify any behavior and is safe.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  string_variables = titanic.select_dtypes(include = np.object).columns

In [18]:
titanic[string_variables]

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,No disponible,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,No disponible,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,No disponible,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,No disponible,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,No disponible,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,No disponible,Q

- Vuelve a comprobar la existencia de NAs y NULL para verificar que los has eliminado.

In [19]:
# Miro donde hay nan
var_nan2 = titanic.isna().sum()
var_nan2

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

### Ejercicio 3

¿Fallecieron más mujeres u hombres?  (Cuánto en porcentaje sobre el total de su género).

In [20]:
sex_0 = pd.DataFrame(titanic.loc[titanic['Survived'] == 0 , 'Sex'].value_counts())
sex_0
# Observamos que murieron mas hombres.

        Sex
male    468
female   81

In [21]:
porc_male = sex_0['Sex'][0]/ len(titanic['Sex'])
porc_female = sex_0['Sex'][1]/ len(titanic['Sex'])

print(porc_male)
print(porc_female)

0.5252525252525253
0.09090909090909091

¿Qué clase de pasajeros (primera, segunda o tercera) sobrevivió más?.

In [22]:
survived = pd.DataFrame(titanic.loc[titanic['Survived'] == 1, 'Pclass'].value_counts())
print(f'La clase que mas sobrevivó fue la',  survived.index[0], 'con' , survived.Pclass[1], 'personas')
survived

La clase que mas sobrevivó fue la 1 con 136 personas

   Pclass
1     136
3     119
2      87

¿Cuál fue la edad media y máxima de los supervivientes en cada una de las clases?

In [23]:
survived_1 = pd.DataFrame(titanic.loc[titanic['Survived'] == 1])
edad_mean_max = survived_1.groupby('Pclass')['Age'].agg(['mean','max'])
edad_mean_max

             mean   max
Pclass
1       34.784615  80.0
2       26.076166  62.0
3       23.232689  63.0

### Ejercicio 4


- ¿Cuál de los puertos de embarque es el que tiene la media de precio de billete más barata? Indica solo ese puerto, no una lista con todos.

In [48]:
fare_embarked = titanic.groupby('Embarked')['Fare'].agg(['mean'])
mean_min = fare_embarked.idxmin()
mean_min

mean    Q
dtype: object

- ¿Qué correlación hay entre la longitud del nombre de un pasajero y el importe de su billete? No modifiques el nombre del pasajero para hacer el cálculo (úsalo tal y como venga).

In [63]:
name_len = titanic['Name'].apply(len)

corr = name_len.corr(titanic['Fare'])
print('La correlación entre la longitud del nombre de un pasajero \
y el importe de su billete es: ' , corr)

La correlación entre la longitud del nombre de un pasajero y el importe de su billete es:  0.15583238266719385

### Ejercicio 5

- Obtén los nombres de los pasajeros que no sobrevivieron y el precio de su billete está en el decil superior.

In [78]:
not_survived = titanic[titanic['Survived'] == 0]
deciles = titanic['Fare'].quantile(0.9)
name_ = pd.DataFrame(not_survived[not_survived['Fare'] > deciles]['Name'])
name_

                                                Name
27                    Fortune, Mr. Charles Alexander
34                           Meyer, Mr. Edgar Joseph
62                       Harris, Mr. Henry Birkhardt
118                         Baxter, Mr. Quigg Edmond
139                               Giglio, Mr. Victor
245                      Minahan, Dr. William Edward
262                                Taussig, Mr. Emil
297                     Allison, Miss. Helen Loraine
332                        Graham, Mr. George Edward
373                              Ringhini, Mr. Sante
377                        Widener, Mr. Harry Elkins
438                                Fortune, Mr. Mark
498  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
505       Penasco y Castellana, Mr. Victor de Satode
527                               Farthing, Mr. John
544                       Douglas, Mr. Walter Donald
557                              Robbins, Mr. Victor
659                       Newell, Mr. Arthur Webster
698                         Thayer, Mr. John Borland
741                    Cavendish, Mr. Tyrell William
789                         Guggenheim, Mr. Benjamin